/*===============================================
*   文件名称：maopao_arry.c
*   创 建 者：     
*   创建日期：2022年06月28日
*   描    述：
================================================*/
#include <stdio.h>

int main(int argc, char *argv[])
{ 
    int a[3][4] = {-1, 9, 1, 3, 7, 2, 5, 6, 10, -9, 0, 4}, *p = a[0];
    for(int i = 0; i < 11; i++)
    {
        for(int j = 0; j < 11-i; j++)
        {
            if(*(p+j) > *(p+j+1))
            {
                *(p+j) ^= *(p+j+1);
                *(p+j+1) ^= *(p+j);
                *(p+j) ^= *(p+j+1);
            }
        }
    }

    for(int i = 0; i < 3; i++){
        for(int j = 0; j < 4; j++)
            printf("%-3d", *p++);
        puts("");
    }

    return 0;
} 
